app/controllers/myshop/posts_controller.rb

  def index
    @posts = Post.where(shop_id:current_shop.id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."shop_id" = ?  [["shop_id", 4]]