app/views/home/index.html.erb

    //　お店の情報が入っているshopContentを使って,処理を行う
    shopContent.map(data => {
        // マーカーをつける
        const marker = new google.maps.Marker({
            position: {lat: data.lat, lng: data.lng},
            map: map
        });

        // マーカークリックしたら吹き出しを表示
        marker.addListener('click', () => {
            //　吹き出しでてたら閉じる.初期化処理をしている
            currentWindow && currentWindow.close();
            //　お店の情報を吹き出しに適用
            const infoWindow = new google.maps.InfoWindow({content: data.shop});
            //吹き出しを表示
            infoWindow.open(map, marker);
            currentWindow = infoWindow;
        });
    });
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]