app/controllers/home_controller.rb

SELECT "shops"."shop_name", "shops"."shop_postal_code", "shops"."shop_address" FROM "shops"
---
  def index
    @shop = Shop.select(:shop_name, :shop_postal_code, :shop_address).to_json