app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    @shops = Shop.all
---
SELECT "posts".* FROM "posts"
SELECT "shops".* FROM "shops"

  def create
    @post = Post.new(post_params)
    @post.shop_id = current_shop.id
    @post.save
---
INSERT INTO "posts" ("product", "price", "product_comment", "product_image_id", "created_at", "updated_at", "shop_id") VALUES (?, ?, ?, ?, ?, ?, ?)