app/controllers/shops_controller.rb

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @shop = Shop.find(params[:id])

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "shops" WHERE "shops"."id" = ?  [["id", 1]]
---
  def destroy
    @shop = Shop.find(params[:id])
    @shop.destroy